#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.apim.azurerm_api_management_named_value.user_func_key_admin will be created
  + resource "azurerm_api_management_named_value" "user_func_key_admin" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "io-wallet-user-func-admin-key"
      + id                  = (known after apply)
      + name                = "io-wallet-user-func-admin-key"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_itn.azurerm_api_management_named_value.user_func_key_admin will be created
  + resource "azurerm_api_management_named_value" "user_func_key_admin" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-wallet-user-func-admin-key"
      + id                  = (known after apply)
      + name                = "io-wallet-user-func-admin-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim.module.apim_v2_wallet_admin_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = "http"
      + description           = "Admin API to delete wallet instances"
      + display_name          = "IO Wallet - ADMIN"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-admin-api"
      + path                  = "api/v1/wallet/admin"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-02.azurewebsites.net/api/v1/wallet"
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + BadRequest           = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Validation error"
                            }
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + ServiceUnavailable   = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Service Unavailable"
                            }
                          + Unauthorized         = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unauthorized"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + FiscalCode  = {
                              + description = "User's fiscal code."
                              + example     = "SPNDNL80R13C555X"
                              + format      = "FiscalCode"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/strings"
                            }
                          + ProblemJson = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 500
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                        }
                      + securitySchemes = {
                          + SubscriptionKey = {
                              + in   = "header"
                              + name = "Ocp-Apim-Subscription-Key"
                              + type = "apiKey"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet API Admin"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/wallet-instances" = {
                          + delete = {
                              + operationId = "deleteWalletInstances"
                              + parameters  = [
                                  + {
                                      + in       = "header"
                                      + name     = "fiscal-code"
                                      + required = true
                                      + schema   = {
                                          + "$ref" = "#/components/schemas/FiscalCode"
                                        }
                                    },
                                ]
                              + responses   = {
                                  + "204" = {
                                      + description = "Wallet instances successfully deleted"
                                    }
                                  + "400" = {
                                      + "$ref" = "#/components/responses/BadRequest"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                  + "503" = {
                                      + "$ref" = "#/components/responses/ServiceUnavailable"
                                    }
                                }
                              + summary     = "Delete wallet instances"
                            }
                        }
                    }
                  + security   = [
                      + {
                          + SubscriptionKey = []
                        },
                    ]
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.module.apim_v2_wallet_admin_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-admin-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-wallet-user-func-admin-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.apim.module.apim_v2_wallet_admin_api.azurerm_api_management_product_api.this["io-p-wallet-admin-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-admin-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-admin-api"
      + resource_group_name = "io-p-rg-internal"
    }

  # module.apim.module.apim_v2_wallet_admin_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + approval_required     = false
      + description           = "Product containing admin APIs"
      + display_name          = "IO WALLET ADMIN APIs"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-admin-api"
      + published             = true
      + resource_group_name   = "io-p-rg-internal"
      + subscription_required = true
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-wallet-support-api;rev=1"
        name                  = "io-p-wallet-support-api"
        # (17 unchanged attributes hidden)

      ~ import {
          ~ content_value  = jsonencode(
              ~ {
                  ~ components = {
                      ~ securitySchemes = {
                          - FunctionsKey    = {
                              - in   = "header"
                              - name = "X-Functions-Key"
                              - type = "apiKey"
                            }
                          + SubscriptionKey = {
                              + in   = "header"
                              + name = "Ocp-Apim-Subscription-Key"
                              + type = "apiKey"
                            }
                        }
                        # (2 unchanged attributes hidden)
                    }
                  ~ paths      = {
                      ~ "/wallet-instances/current" = {
                          ~ post = {
                              ~ security    = [
                                  ~ {
                                      - FunctionsKey    = []
                                      + SubscriptionKey = []
                                    },
                                ]
                                # (4 unchanged attributes hidden)
                            }
                        }
                    }
                  - servers    = [
                      - {
                          - url = "https://io-p-itn-wallet-support-func-01.azurewebsites.net/api/v1/wallet"
                        },
                    ]
                    # (2 unchanged attributes hidden)
                }
            )
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2_wallet_admin_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "Admin API to delete wallet instances"
      + display_name          = "IO Wallet - ADMIN"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-admin-api"
      + path                  = "api/v1/wallet/admin"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-02.azurewebsites.net/api/v1/wallet"
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + BadRequest           = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Validation error"
                            }
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + ServiceUnavailable   = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Service Unavailable"
                            }
                          + Unauthorized         = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unauthorized"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + FiscalCode  = {
                              + description = "User's fiscal code."
                              + example     = "SPNDNL80R13C555X"
                              + format      = "FiscalCode"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/strings"
                            }
                          + ProblemJson = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 500
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                        }
                      + securitySchemes = {
                          + SubscriptionKey = {
                              + in   = "header"
                              + name = "Ocp-Apim-Subscription-Key"
                              + type = "apiKey"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet API Admin"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/wallet-instances" = {
                          + delete = {
                              + operationId = "deleteWalletInstances"
                              + parameters  = [
                                  + {
                                      + in       = "header"
                                      + name     = "fiscal-code"
                                      + required = true
                                      + schema   = {
                                          + "$ref" = "#/components/schemas/FiscalCode"
                                        }
                                    },
                                ]
                              + responses   = {
                                  + "204" = {
                                      + description = "Wallet instances successfully deleted"
                                    }
                                  + "400" = {
                                      + "$ref" = "#/components/responses/BadRequest"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                  + "503" = {
                                      + "$ref" = "#/components/responses/ServiceUnavailable"
                                    }
                                }
                              + summary     = "Delete wallet instances"
                            }
                        }
                    }
                  + security   = [
                      + {
                          + SubscriptionKey = []
                        },
                    ]
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn.module.apim_v2_wallet_admin_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-admin-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-wallet-user-func-admin-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.apim_itn.module.apim_v2_wallet_admin_api.azurerm_api_management_product_api.this["io-p-wallet-admin-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-admin-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-admin-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn.module.apim_v2_wallet_admin_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product containing admin APIs"
      + display_name          = "IO WALLET ADMIN APIs"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-admin-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim_itn.module.apim_v2_wallet_support_api.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-wallet-support-api;rev=1"
        name                  = "io-p-wallet-support-api"
        # (17 unchanged attributes hidden)

      ~ import {
          ~ content_value  = jsonencode(
              ~ {
                  ~ components = {
                      ~ securitySchemes = {
                          - FunctionsKey    = {
                              - in   = "header"
                              - name = "X-Functions-Key"
                              - type = "apiKey"
                            }
                          + SubscriptionKey = {
                              + in   = "header"
                              + name = "Ocp-Apim-Subscription-Key"
                              + type = "apiKey"
                            }
                        }
                        # (2 unchanged attributes hidden)
                    }
                  ~ paths      = {
                      ~ "/wallet-instances/current" = {
                          ~ post = {
                              ~ security    = [
                                  ~ {
                                      - FunctionsKey    = []
                                      + SubscriptionKey = []
                                    },
                                ]
                                # (4 unchanged attributes hidden)
                            }
                        }
                    }
                  - servers    = [
                      - {
                          - url = "https://io-p-itn-wallet-support-func-01.azurewebsites.net/api/v1/wallet"
                        },
                    ]
                    # (2 unchanged attributes hidden)
                }
            )
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_storage_container.well_known,
  on ../_modules/cdn/storage_account.tf line 29, in resource "azurerm_storage_container" "well_known":
  29:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
